insert into executor (executor_name)
values 
('Цой'), 
('Miyagi'),
('Лепс'),
('Егор Крид'),
('Михаил Круг'),
('Стас Михайлов'),
('GAYAZOV$ BROTHER$'),
('Бетховен'),
('Моцарт');
insert into music_genre (genre_name)
values 
('Рок'),
('Реп'),
('Классика'),
('хип-хоп'),
('Поп'),
('Шансон');
insert into collection (collection_name, release_date)
values 
('Сборник классики','2022 10 12'),
('Песни 2000-ых', '2018 06 01'),
('Поп сборник', '2022 06 22'),
('Для тренировок', '2017 10 30'),
('Новый год', '2011 12 20'),
('Расслабиться', '2011 11 03'),
('Семейная музыка', '2017 03 09'),
('Для зачета', '2022 02 22');
insert into genre_executor ()
values
('1', '1'),
('2', '2'),
('4', '2'),
('1', '3'),
('5', '3'),
('1', '4'),
('2', '4'),
('5', '4'),
('6', '5'),
('6', '6'),
('2', '7'),
('4', '7'),
('3', '8'),
('3', '9');
INSERT INTO album (album_name, release_date)
values 
('Классика', '1980 01 01'),
('ПОШЛА ЖАРА', '2021 03 11'),
('Шансон', '2016 11 29'),
('Butser Keaton', '2019 01 01'),
('Квартирные концерты', '1985 10 27'),
('Песни 90-20', '2001 06 24'),
('Лучшие песни', '2016 04 01'),
('Дуэты', '2012 08 18');
insert into executors_alboms (executor_id, album_id)
values 
('1','5'),
('2','4'),
('3','3'),
('4','7'),
('5','8'),
('6','7'),
('7','2'),
('8','1'),
('9','1');
insert into track (item_id, track_name, duration)
values
('5', 'Алюминиевы огурцы', '00:2:38'),
('5', 'Последний герой', '00:2:57'),
('4', 'Intro', '00:1:30'),
('4', 'Captain', '00:3:34'),
('3', 'Бейби', '00:4:08'),
('7', 'Lambo Urus', '00:2:28'),
('7', 'Здраствуйте', '00:2:16'),
('8', 'Владимирский Централ', '00:4:28'),
('8', 'Все сбудеться', '00:2:45'),
('7', 'Я буду очень тебя беречь!', '00:3:28'),
('2', 'Пошла жара', '00:2:50'),
('2', 'Шоу - биз', '00:3:14'),
('1', 'Moonlight Sonata', '00:5:37'),
('1', 'Sonata №1', '00:2:51'),
('1', 'Serenade No.13', '00:5:41'),
('1', 'Symphony No.40', '00:8:20');
insert into track_colection (track_id, collection_id)
values 
('1', '8'),
('2', '8'),
('3', '3'),
('4', '3'),
('5', '2'),
('6', '3'),
('7', '2'),
('8', '2'),
('9', '2'),
('10', '2'),
('11', '5'),
('12', '6'),
('13', '1'),
('14', '1'),
('15', '1'),
('16', '1');